In [8]:
import pandas as pd

In [9]:
import sqlite3

In [ ]:
#pip install ipython-sql

In [10]:
tmpdb = sqlite3.connect('tmp1.db')

In [12]:
%load_ext sql

In [13]:
%sql sqlite:///tmp1.db

In [14]:
%%sql 
CREATE TABLE IF NOT EXISTS Salesman (
  Salesman_id TEXT PRIMARY KEY,
  name TEXT,
  city TEXT,
  Comission REAL
);

 * sqlite:///tmp1.db
Done.

[]

In [15]:
%%sql 

INSERT INTO Salesman (Salesman_id, name, city, Comission) VALUES
  ('5001', 'James Hoog', 'New York', 0.15),
  ('5002', 'Nail Knite', 'Paris', 0.13),
  ('5005', 'Pit Alex', 'London', 0.11),
  ('5006', 'Mc Lyon', 'Paris', 0.14),
  ('5007', 'Paul Adam', 'Rome', 0.13),
  ('5003', 'Lauson Hen', 'San Jose', 0.12);

 * sqlite:///tmp1.db
6 rows affected.

[]

In [18]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [19]:
%%sql

SELECT * 
FROM Salesman

 * sqlite:///tmp1.db
Done.

[('5001', 'James Hoog', 'New York', 0.15),
 ('5002', 'Nail Knite', 'Paris', 0.13),
 ('5005', 'Pit Alex', 'London', 0.11),
 ('5006', 'Mc Lyon', 'Paris', 0.14),
 ('5007', 'Paul Adam', 'Rome', 0.13),
 ('5003', 'Lauson Hen', 'San Jose', 0.12)]

In [20]:
%%sql

CREATE TABLE IF NOT EXISTS Orders (
  ord_no TEXT PRIMARY KEY,
  purch_amt REAL,
  ord_date TEXT,
  customer_id TEXT,
  Salesman_id TEXT
);

 * sqlite:///tmp1.db
Done.

[]

In [21]:
%%sql

INSERT INTO Orders (ord_no, purch_amt, ord_date, customer_id, Salesman_id) VALUES
  ('70001', 150.5, '2012-10-05', '3005', '5002'),
  ('70009', 270.65, '2012-09-10', '3001', '5001'),
  ('70002', 65.26, '2012-10-05', '3002', '5003'),
  ('70004', 110.5, '2012-08-17', '3009', '5007'),
  ('70007', 948.5, '2012-09-10', '3005', '5005'),
  ('70005', 2400.6, '2012-07-27', '3007', '5006');

 * sqlite:///tmp1.db
6 rows affected.

[]

In [22]:
%%sql

SELECT * FROM Orders;

 * sqlite:///tmp1.db
Done.

[('70001', 150.5, '2012-10-05', '3005', '5002'),
 ('70009', 270.65, '2012-09-10', '3001', '5001'),
 ('70002', 65.26, '2012-10-05', '3002', '5003'),
 ('70004', 110.5, '2012-08-17', '3009', '5007'),
 ('70007', 948.5, '2012-09-10', '3005', '5005'),
 ('70005', 2400.6, '2012-07-27', '3007', '5006')]

In [23]:
%%sql

SELECT name, Comission
FROM Salesman;

 * sqlite:///tmp1.db
Done.

[('James Hoog', 0.15),
 ('Nail Knite', 0.13),
 ('Pit Alex', 0.11),
 ('Mc Lyon', 0.14),
 ('Paul Adam', 0.13),
 ('Lauson Hen', 0.12)]